In [7]:
import pandas as pd   # importing padas library for data manipulation
df = pd.read_csv("Patient_Data.csv")
df

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45
5,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00

In [8]:
df.info()

# shows information about dataset columns, data types, and missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

In [9]:
# 2. selects only relevant columns

billing_df = df[['PatientID', 'Department', 'Doctor', 'BillAmount']]
billing_df

# shows only the necessary columns for billing analysis

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [10]:
# 3. drop columns

df_new = df.drop(['ReceptionistID','CheckInTime'],axis=1)
df_new

# drop() - remove columns that are not required for further analysis
# axis=1 indicates that we are dropping columns

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

In [11]:
# 4. groupby

total_bill_per_dep = df.groupby('Department')['BillAmount'].sum()
total_bill_per_dep

# groupby() - group's data by 'Department' and calculate the total 'BillAmount' for each department then prints results

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

In [12]:
# 5. Remove duplicates

df_unique = df_new.drop_duplicates(subset='PatientID')
df_unique

# drop_duplicates() - remove's duplicate rows using PatientID to ensure each patient appears only once

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

In [13]:
# 6. Filling missing value

mean = df_unique['BillAmount'].mean()
print("Mean: ",mean)

df_unique.loc[:,'BillAmount'] = df_unique['BillAmount'].fillna(mean)
df_unique

# mean() - calculates the average of 'BillAmount' column
# .loc used to safely replace missing values
# fillna() - will replace missing values(NaN) with calculated mean in 'BillAmount'

Mean:  6233.333333333333

   PatientID     Name   Department     Doctor   BillAmount
0        101    Alice   Cardiology  Dr. Smith  5000.000000
1        102      Bob    Neurology   Dr. John  6233.333333
2        103  Charlie  Orthopedics    Dr. Lee  7500.000000
3        104    David   Cardiology  Dr. Smith  6200.000000
4        105      Eva  Dermatology   Dr. Rose  6233.333333

In [14]:
import pandas as pd
bill_df = pd.read_csv("Billing_Data.csv")
bill_df

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [15]:
# 7. merging two datasets

combine_data = pd.merge(df_unique,bill_df,on='PatientID')
combine_data

# merge() - merges the cleaned dataset with billing dataset using common column 'PatientID'

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.000000,2000,3000
1,102,Bob,Neurology,Dr. John,6233.333333,1500,3500
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,2500,5000
3,104,David,Cardiology,Dr. Smith,6200.000000,3000,3200
4,105,Eva,Dermatology,Dr. Rose,6233.333333,1000,4000

In [16]:
# 8. adding new row's to the dataset and concatenating into our data

new_patients = pd.DataFrame({
    'PatientID': [106, 107],
    'Name': ['Lahari', 'Poojitha'],
    'Department': ['Pediatrics', 'Oncology'],
    'Doctor': ['Dr. Green', 'Dr. White'],
    'BillAmount': [4800.0, 7100.0],
    'InsuranceCovered': [1200, 2000],
    'FinalAmount': [3600, 5100]
})

df_updated = pd.concat([combine_data,new_patients],axis=0,ignore_index=True)
df_updated

# Created a new dataset for patients with two new rows
# adding the new patients data to the existing dataset(combinw_data) using row-wise(axis=0) concatenation

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.000000,2000,3000
1,102,Bob,Neurology,Dr. John,6233.333333,1500,3500
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,2500,5000
3,104,David,Cardiology,Dr. Smith,6200.000000,3000,3200
4,105,Eva,Dermatology,Dr. Rose,6233.333333,1000,4000
5,106,Lahari,Pediatrics,Dr. Green,4800.000000,1200,3600
6,107,Poojitha,Oncology,Dr. White,7100.000000,2000,5100

In [17]:
# 9. adding new column's to the dataset and concatenating into our data

new_columns = pd.DataFrame({
    'Discount' : [20, 30, 10, 30, 40, 50, 100],
    'Tax' : [100, 200, 300, 400, 300, 230, 500]
})

df_final = pd.concat([df_updated,new_columns],axis=1)
df_final

# Created a new dataset with additional new columns like 'Discount' and 'Tax'
# adding the new_columns data to the existing dataset(df_updated) using column-wise(axis=1) concatenation

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount,Discount,Tax
0,101,Alice,Cardiology,Dr. Smith,5000.000000,2000,3000,20,100
1,102,Bob,Neurology,Dr. John,6233.333333,1500,3500,30,200
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,2500,5000,10,300
3,104,David,Cardiology,Dr. Smith,6200.000000,3000,3200,30,400
4,105,Eva,Dermatology,Dr. Rose,6233.333333,1000,4000,40,300
5,106,Lahari,Pediatrics,Dr. Green,4800.000000,1200,3600,50,230
6,107,Poojitha,Oncology,Dr. White,7100.000000,2000,5100,100,500